---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InstanceMovesWithGridParam
source: html/009debbb-dbf5-59a0-b7b9-695c7c17cccf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InstanceMovesWithGridParam Property

"Moves With Grids"

## Syntax (C#)
```csharp
public static ForgeTypeId InstanceMovesWithGridParam { get; }
```